
## Plan Result

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/7687168558)


<pre><code>Plan: 3 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * aws_lambda_function.lambda
  * aws_lambda_permission.apigw_lambda
  * local_file.index_page
* Update
  * aws_api_gateway_integration.integration
  * aws_s3_bucket.images
  * aws_s3_bucket.website


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-o1e3qkz6f9-rwxfg3-POST"
      ~ uri                     = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:053932140667:function:mtchoun-mouh-lambda-layer-user_registration_consulcam/invocations" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + filename                       = "api/lambda.zip"
      + function_name                  = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      + handler                        = "lambda.register_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:1",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::053932140667:role/website-deployer"
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "e2ufzPH1fm1YKjl/alhoIobY0clxFKvSfI9g6qdn0/Y="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                       = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_KEY"         = (sensitive value)
              + "BUCKET_NAME"     = "mtchoun-mouh-lambda-layer-djansang"
              + "ENV"             = "mtchoun-mouh-lambda-layer"
              + "LINKS_TABLE"     = "mtchoun-mouh-lambda-layer-Link_table"
              + "MAINTAINER_MAIL" = (sensitive value)
              + "REGION"          = "eu-central-1"
              + "REGISTERS_TABLE" = "mtchoun-mouh-lambda-layer-Register"
              + "SENTRY_DNS"      = (sensitive value)
              + "USERS_TABLE"     = "mtchoun-mouh-lambda-layer-Users"
            }
        }
    }

  # aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:eu-central-1:053932140667:o1e3qkz6f9/*/POST/register"
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-lambda-layer-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 3 to add, 3 to change, 0 to destroy.

```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_lambda_function.lambda has been deleted
  - resource "aws_lambda_function" "lambda" {
      - function_name                  = "mtchoun-mouh-lambda-layer-user_registration_consulcam" -> null
        id                             = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      - invoke_arn                     = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:053932140667:function:mtchoun-mouh-lambda-layer-user_registration_consulcam/invocations" -> null
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":144,"Program":"tfcmt","SHA1":"7b16cd0b23d2243882fd4c10adaf152311e3a737","Vars":{},"WorkflowName":"Deploy cases"} -->